[
  {
    "path": "posts/welcome/",
    "title": "Welcome to VAST Challenge - Mini Challenge 1",
    "description": "This blog is for the assignment submission for VAST Challenge - Mini Challenge 1.",
    "author": [
      {
        "name": "Lim Jin Ru (Alethea)",
        "url": {}
      }
    ],
    "date": "2021-07-23",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-23T01:23:54+08:00",
    "input_file": "welcome.knit.md"
  },
  {
    "path": "posts/2021-07-23-vast-challenge-2021-mini-challenge-1/",
    "title": "VAST Challenge 2021: Mini Challenge 1",
    "description": "Answers to Mini Challenge 1",
    "author": [
      {
        "name": "Lim Jin Ru (Alethea)",
        "url": {}
      }
    ],
    "date": "2021-07-23",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOverview\r\nBackground\r\nLiterature Review, Objective and Motivation\r\nData Preparation\r\nAnswers\r\nNeed to include comparison with centrum sentinel side by side\r\nMissing image\r\nReferences\r\n\r\nOverview\r\nThis assignment is based on VAST Challenge 2021. The selected challenge topic for this assignment is Mini-Challenge 1.\r\nIn the roughly twenty years that Tethys-based GAStech has been operating a natural gas production site in the island country of Kronos, it has produced remarkable profits and developed strong relationships with the government of Kronos. However, GAStech has not been as successful in demonstrating environmental stewardship.\r\nIn January 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance.\r\nThe Protectors of Kronos (POK) is a political activist movement stemmed from concerns about contamination from drilling at the Tiskele Bend gas fields. An international agency has tested water from the Tiskele River both upstream and downstream of the Tiskele Bend gas fields and confirmed that the presence of contaminants is consistent with pollution from Hyper Acidic Substrate Removal, a gas drilling technique employed by GAStech at the Tiskele Bend fields and these test results have also been published in several international journals.\r\nMy role is to use visual analytics to help law enforcement from Kronos and Tethys discover the relationships among the people and organizations.\r\nBackground\r\nMini-Challenge 1 looks at the relationships and conditions that led up to the kidnapping. As an analyst, I’d be analysing a set of current and historical news reports, resumes of numerous GAStech employees and email headers from two weeks of internal GAStech company email to identify the complex relationships among all of these people and organizations.\r\nLiterature Review, Objective and Motivation\r\nIn the literature review conducted of the 2014 VAST Challenge submissions covering the same crime case but with different questions, it was observed that many of the visualizations were quite informative and had their own strengths but there were some limitations or areas to improve as well.\r\nSome areas that can be further improved on:\r\nUnidirectional tree diagrams were used to display relationships, but such diagrams lack the ability to show the dynamics of how multiple parties act as connectors of the various organizations/people\r\nCluttered network diagrams with labels obscured by arrows\r\nSome of the network diagrams for emails between GAStech employees were not easy to visualize some embedded relationships (e.g. relationships within the department)\r\nThe proposed visualizations will attempt to overcome some of these limitations.\r\nThe participants used a variety of tools for their visualizations. For this assignment, the approach will be to utilize R programming solely as there are numerous visualization packages available in the R environment with useful functions and great adaptability. There are also many new packages constantly being pushed out in the R community. For this assignment, some of the newer R packages will also be explored and applied, including corporaexplorer published in 2021 and LDAvis published in 2015.\r\nData Preparation\r\nData extraction, wrangling and data preparation were performed with R, primarily with tidyverse methods.\r\nAnswers\r\nQn: Characterize the news data sources provided. Which are primary sources and which are derivative sources? What are the relationships between the primary and derivative sources?\r\nTo determine whether a news article is a primary or derivative source, a few visualisations would be used.\r\nThere are many characteristics that differentiate a primary and derivative source. A derivative source is any record that relies on other records for its information.\r\nAs derivative sources are second-hand account of events, they will cover information from the primary source, often providing additional analysis and interpretation. A correlation analysis of documents published by the news companies can help give us clues in the primary and derivative source relationships.\r\nFirst, the correlation is set very low to allow us to explore the overall correlation between all the news sources of the different companies.\r\n\r\nTethys News is an outlier and needed a closer inspection for analysis.\r\nA corpus exploration tool created from ‘corporaexplorer’ package in R was used. Tethys News’ articles have an update timestamp instead of just a publication date which suggests that their reporting are quite recent/close to the event. News that are written or made during or close to the time of the event is a characteristic of a primary source. Hence, Tethys News is likely to be a primary source.\r\n\r\nA high correlation of the news companies suggests that that the articles between the two companies are highly similar and that they may either both be derivative sources as they analyse and interpret each other’s work or that one is a primary source and the other is a derivative source as the latter aims to analyse and interpret the primary source, hence referencing a substantial amount of content from the primary source to facilitate analysis/interpretation. A correlation of 0.70 is selected to evaluate the relationships.\r\n\r\nA number of clusters were formed with Centrum Sentinel and Modern Rubicon being quite far from the group, suggesting that they have higher likelihood of being of a primary source.\r\nFor the others with high correlation with each other, they are likely to be derivative sources.\r\nFor instance, Athena Speaks and Central Bulletin have a correlation of more than 0.8. This suggests that their news articles are highly similar.\r\nThe corpus exploration tool is used to examine the articles in two news companies. To allow a focus on a common topic, the corpus filter setting is set to include “kidnap—1”. This phrase will prompt the corporaexplorer to keep only articles with the word “kidnap” appearing at least once.\r\nA comparison between Athena Speaks – 140 article and Central Bulletin – 673 article shows that their articles’ content are almost identical with just a paraphrasing of the text, suggesting that they are likely both derivative sources of another source or a record of each other.\r\n\r\nNeed to include comparison with centrum sentinel side by side\r\nOther examples below are between “the general post” and “the light of truth” and between “All News Today” and “Homeland Illumination”.The high similarity in text resulted in the high correlation seen in the earlier correlation network diagram and supports the hypothesis that the high correlation (especially those that are higher than correlation of 0.80) suggests that the news articles are likely both derivative sources of another source or that one is a derivative source of the other.\r\nMissing image\r\nThe corpus exploration tool created from the R package can also allow us to have a quick overview of the primary and derivative sources with its key term highlight function.\r\nPrimary sources include original document information such as interviews. Hence, the term “say” can be used to locate the primary source article as they represent first-hand accounts. This is placed in the red-colored term to chart and highlight. The name of others news companies can be used to locate the derivative source articles. This is placed in the blue-colored term to chart and highlight.\r\n\r\nIn the above created visualization, one can now quickly see which is a primary and which is a derivative source by referring to the red-colored tiles for the primary source and blue-colored tiles for the derivative sources. For example, World Journal - Article 396 was flagged as a derivative source with its blue tile. After clicking on the tile, the document information pops up on the right and indeed, there was a reference made to “corresponding times in Abila” suggesting that World Journal is indeed a derivative source.\r\nBased on this visualization, we can infer that Centrum Sentinel and Homeland Illumination are likely to be primary sources. Homeland Illumination is likely to be the primary source for a number of news articles that are highly correlated with it such as News Online Today, The Wrap, The Orb, All News Today and Daily Pegasus. Centrum Sentinel is also likely to be the primary source for Modern Rubicon when we view the correlation visualization together with this corporaexplorer visualization.\r\nIt is helpful to understand which news source are primary sources and derivative sources as the law enforcers can derive different types of value from this two group of sources. For example, primary source are especially useful to get the latest accurate updates and to ensure minimum “embellishment” that can bring about confusion to the case. Derivative sources are especially useful for understand history of related personnel or uncover certain goals of suspects since additional research, compilation and analysis has gone into derivative sources.\r\nQn 2: Characterize any biases you identify in these news sources, with respect to their representation of specific people, places, and events. Give examples.\r\nThe above visualization shows the TFIDF, short for term frequency–inverse document frequency of the terms, “apa”, “gastech”, “government” and “pok” for all news companies. Note that lowercase is used here as the data has been transformed to all lowercase to aid detection of the words.\r\nTopic 1: APA, Drugs (negative sentiment about APA in general)\r\nThe army of people Asterian (APA) is paramilitary organization which has been busy with terrorist activities which are financed by its criminal ventures, which include drug trafficking. The key words are associated with designer drugs with street names called “cotton candy” with its official name called methyldimethyl cathinone (MDMC). Carmin Bodrogi and was arrested in 1993 for possession of MDMC and intention to deliver the drug. If Henk Bodrogi is related to Carmin Bodrogi, then it will signal a link between POK and APAC. The key word Loblaw was mentioned. Mr. Robert Loblaw is an Interpol Senior Inspector who was working to fight the distribution of MDMC and linked it with the army of Asterian. Bianca was also mentioned and she is a nurse manager at the Emergency Department. The drug causes violence and strange behavior and is “difficult” to treat (difficult is another key word in this topic).\r\nTopic 2: anti-POK in general, pro-government The word “heroic” refers to the police.\r\nThe word “hooligans” refers to POK.\r\nTopic 3: Government, GAStech (negative sentiment in general) The words “WFA”, “level”, “barium” and “blame”, “government”, “gastech” all refers to the WFA’s test on water surrounding Elodis for which it blamed both GAStech International and the Government of Kronos for the contamination.\r\nTopic 4: Pro-POK cause supporters, anti-government; focusing on Elodis news and the heath concerns including cancer caused by contamination (“benzene” key word) in the river.\r\nFrom the key words, we managed to find out more about the key players here: - Henk Bodrogi (founder of POK due to health concerns) - Pondo Reese (editor of weekly newspaper of Elodis and concerned about the worsening contamination) - Joclyn Reynolds (project coordinator for “Wellness for All”). - Juliana Vann (ten year old girl who died in 1998 of cancer caused by the benzene in her drinking water.) Side discoveries: - Carmin Bodrogi (shares family name with Elian Bodrogi was arrested in 1993 for drug possession – MDMC – might be linked to APAC). - Elian Karel, son of Jeroen and Antaura Karel (was only a few years older than Juliana Vann, a friend who died in 1998 of toxin poisoning caused by illegal dumping from the Tethyn company GAStech) and had been involved with the POK mission since he was young - Protests broke out with chants of “Remember Juliana!” one can also hear cries “Remember Elian!” Elian Karel, died of “normal causes” in prison.\r\nTopic 5: Anti-GAStech Though at first glance, the words individually do not seemed to be negative, upon reviewing the words in the data table, the context of the words were about the CEO, “Sten Sanjorge Jr” who became a billionaire, international investors such as Mr Noriega who insinuated that GAStech has an unusual relationship with the government, the GAStech International’s Environmental Safety Advisor Ingmar Casablancas who rejected the alleged environmental claims against GAStech International and responded that GAStech International and the Government of Kronos cooperate tirelessly to ensure a clean, safe, and prosperous work place.\r\nTopic 6: More neutral and covers both local community and government’s perspectives This topic in general covers similar topics as topic 4 but is more neutral in tone. It comments more about the local (home, township etc) community’s concerns, government malfeasance and the loss of the tax bill that would otherwise help to provide funds for environment cleanup of drinking and irrigation water. It also covers Elian Karel’s spurious arrest but also covers the police representative’s comments that he would be treated humanely.\r\nIn summary, the dominant topics for each newsgroup can give us clues on the biases of these news sources, with respect to their representation of specific people, places, and events. Topics Bias NewsGroup (as represented by their dominated topic) Topic 1 Anti-APA Worldwise The Truth The Guide Kronos Star International News Topic 2 Anti-POK Pro-government The Light of Truth The Tulip The General Post The World Who What News Topic 3 Anti-government Anti-GAStech Centrum Sentinel Topic 4 Pro-POK Anti-government Athena Speaks Modern Rubicon The Abila Post The Explainer Central Bulletin Tethys News News Desk Topic 5 Anti-GAStech Daily Pegasus All News Today Homeland Illumination The Wrap The Orb Topic 6 More neutral and covers both local community and government’s perspectives The Continent World Journal International Times World Source Everyday News\r\nGiven the data sources provided, use visual analytics to identify potential official and unofficial relationships among GASTech, POK, the APA, and Government. Include both personal relationships and shared goals and objectives. Provide evidence for these relationships. Please limit your answer to 6 images and 400 words.\r\nAnswer: In investigating the historical records, we know that Isia Vann is the older brother of Juliana Vann, the 10-year-old girl who died in 1998 after an illness related to drinking contaminated water from the Tiskele River. The contamination had been associated with the Hyper Acidic Substrate Removal (HASR) technique, a technology associated with natural gas drilling operations and is suspected to be a result of Gastech’s gas drilling operations several kilometers upstream of the Tiskele River. Isia Vann is also a member in the Protectors of Kronos (POK), a political activist movement that was started from concerns about contamination from drilling at the Tiskele Bend gas fields. He was one of several POK members who advocated for a more forceful approach to gaining attention to the plight of people living downstream of Tiskele Bend and has been arrested several times for civil disobedience and trespassing during POK rallies. Answer: Non-work related emails sent between colleagues at GAStech can help us uncover personal relationships among them since there is a higher tendency to send such emails to those that one is closer to.\r\nInsights: There are two pairs of relationships that are particularly striking. One is between Rachel Pantanal (id: 38), Assistant to CIO and Isia Vann (id: 43), Perimeter Control. They display a close relationship as we can see that they exchange non-work related emails with each other on majority of the days in the week. On closer inspection of their emails, there was an email about whether Rachel liked the flowers and she responded positively. This suggests a potential romantic relationship between the both of them. Isia Vann has a personal grudge against GAStech for the death of his sister and is part of the more radical-minded members at POK according to the historical documents. If he is in a romantic relationship with Rachel, Rachel may be sympathetic to his causes. Another pair is Rachel Pantanal (id: 38) and Ruscella Mies Haber (id: 33) as they shared a non-work related email exchange on Sunday. It is very unusual for employees at GAStech to send non-work related emails to each other on weekends so this is an outlier. Upon inspection of the data, we realized that the exchanged email is titled “RE: FW: ARISE - Inspiration for Defenders of Kronos”. ARISE is a publication by the Asterian People’s Army APA , a paramilitary organization which has been engaged in terrorist activities funded through its criminal enterprises which include drug trafficking and has been associated with POK. The fact that the email was sent on Sunday might also be due to some level of urgency prior to the kidnapping. ARISE’s connection with APA was picked up via the visual corpus exploration tool (see images below).\r\nExchange of the suspicious “ARISE - Inspiration for Defenders of Kronos” email\r\nThe suspicious “ARISE” email was exchanged among the above group of colleagues. It was first sent from Rachel to Ruscella and then there was an exchange of information among Hennie, Ruscella, Loreto, Isia, Inga and Minke, suggesting an ongoing conversation about this email among the group.\r\nAs Rachel is from the administration department, investigators may be able to find out more clues from other members of the administration department as there is frequent interaction between Rachel and her colleagues in the same department on non-work related emails suggesting a close relationship with them.\r\nIsia Vann has non-work related email exchanges with Rachel Pantanal (Assistant to CIO, Tethys Citizenship), Claudio Hawelon (Truck Driver, Kronos Citizenship), Mat Bramar (Assistant to CEO, Tethys Citizenship) and Inga Ferro (Site Control, Kronos Citizenship). Although Claudio did not receive the “ARISE” email, police investigators might still want to try to interview him since he has a relatively closer relationship with Isia than other colleagues in the company and might be privy to some information related to the suspect.\r\nThe above image shows the email exchanges for non-work-related emails outside office hours with at least 2 exchanges in the 14-day period. There are 4 clusters with such exchanges. 1 cluster is the facilities department among their own department members. Another cluster is the IT technicians without the IT manager. For the executives cluster, the cluster is among the CEO, CIO and Environmental Safety Advisor. The fourth cluster is the administration cluster connected with some members of the security department through Rachel and Isia. This again highlights an anomaly as colleagues usually form closer informal relationships within their department and less often outside their department. The relationship between Rachel and Isia is worthy to be further investigated. It is also interesting to note that the news articles mentioned that Edvard Vann, the guard of safety at GAStech was questioned for hours on suspicion of his involvement with the kidnapping due to the similarity between his name and that of a Protector of Kronos member. However, we see in the above diagram that Edvard is not only not connected to the suspected group of people with the suspicious “Arise” email, he also does not correspond with any of the other colleagues outside office hours, suggesting that he does not have a strong personal relationship with his colleagues. Unless he uses other modes of communication, this does suggest that he may indeed not be related to the suspected “Protector of Kronos” member.\r\nAn honorable discharge occurs when a military service member received a good or excellent rating for their service time, by exceeding standards for performance and personal conduct. If a service member’s performance is satisfactory but the individual failed to meet all expectations of conduct for military members, the discharge is considered a General Discharge. To receive a General Discharge from the military, there has to be some form of nonjudicial punishment to correct unacceptable military behavior or failure to meet military standards. The discharging officer must give the reason for the discharge in writing, and the military member must sign paperwork stating they understand the reason for their discharge . It is worthy to investigate why the majority of the suspected group was given a general discharge and if it was due to extreme ideologies/goals etc. With the exception of Ruscella as she was much older, all of the suspected members in the group (Hennie, Isia, Loreto, Inga, Minke) had overlap in service with at least one other member in this group. This means that there were likely some unofficial relationships/contact with each other in the Army before they joined GAStech. The “General Discharge” instead of “Honorable Discharge” could also potentially be a reflection of their relationship with the Krono government/concerns that Krono government has regarding them.\r\nNote that Rachel is a Tethys citizen so she did not serve in the Armed Forces of Kronos.\r\nThe visualization below maps the potential official and unofficial relationships that the GAStech employees potentially have with APA, POK. It has come to our attention that four out of six members of the earlier mentioned suspected group have relationships with APA and POK through connected family members. Connected family members may suggest some common ideologies though that is not guaranteed and required further investigation. However, when we overlap these multiple visualizations, it shows that the majority of the suspected group do have a common goal as they have multiple connections with POK and/or APA.\r\nReferences\r\nhttp://visualdata.wustl.edu/varepository/VAST%20Challenge%202014/challenges/MC1%20-%20Disappearance%20at%20GASTech/entries/Peking%20University/\r\nhttp://visualdata.wustl.edu/varepository/VAST%20Challenge%202014/challenges/MC1%20-%20Disappearance%20at%20GASTech/entries/Georgia%20Institute%20of%20Technology/\r\nhttp://visualdata.wustl.edu/varepository/VAST%20Challenge%202014/challenges/MC1%20-%20Disappearance%20at%20GASTech/entries/Tianjin%20University%20-%20Gao/\r\nhttps://kgjerde.github.io/corporaexplorer/articles/jane_austen.html\r\nhttps://ldavis.cpsievert.me/reviews/reviews.html\r\nhttps://rpubs.com/cosmopolitanvan/topicmodeling\r\nhttps://bookdown.org/yih_huynh/Guide-to-R-Book/tidyverse.html\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-23T03:45:25+08:00",
    "input_file": "vast-challenge-2021-mini-challenge-1.knit.md"
  }
]
